// @ts-nocheck
// This comment is added by i18n-exclude script and should be automatically removed after build.
// If you see this comment in the file, it means there is something wrong during the build process.

// ATTENTION: This file is auto-generated from source code. Do not edit manually!

import type { I18nLangInfoTranslation } from '../models';

const languageInfo: I18nLangInfoTranslation = {
  artTemplate: {
    desc: 'اعلی کارکردگی والا جاوا اسکرپٹ ٹیمپلیٹنگ انجن۔',
    link: '<1> <tag-2>آرٹ-ٹیمپلیٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>آرٹ-ٹیمپلیٹ کی دستاویزات</tag-4> </tag-3>',
    name: 'آرٹ-ٹیمپلیٹ',
  },
  asciidoc: {
    desc: 'ایسکی ڈاک کو ایسکی ڈاکٹر کے ذریعے HTML میں تبدیل کیا گیا۔',
    link: '<1> <tag-2>ایسکی ڈاک کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ایسکی ڈاکٹر کی سرکاری ویب سائٹ</tag-4> </tag-3> <tag-5> <tag-6>ایسکی ڈاکٹر کی دستاویزات</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X = ایسکی ڈاک</tag-8> </tag-7>',
    name: 'ایسکی ڈاک',
  },
  assemblyscript: {
    desc: 'ویب اسمبلی کے لیے ٹائپ اسکرپٹ جیسی زبان۔',
    link: '<1> <tag-2>اسمبلی اسکرپٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>اسمبلی اسکرپٹ کی دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'اسمبلی اسکرپٹ',
  },
  astro: {
    desc: 'کم کلائنٹ-سائڈ جاوا اسکرپٹ کے ساتھ تیز تر ویب سائٹس بنائیں۔ (ابھی بھی بیٹا میں ہے)',
    link: '<1> <tag-2>ایسٹرو کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ایسٹرو کی دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'ایسٹرو',
  },
  babel: {
    desc: 'جاوا اسکرپٹ کمپائلر',
    link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>بابل کی دستاویزات</tag-4> </tag-3>',
    name: 'بابل',
  },
  bbcode: {
    desc: 'بی بی کوڈ ("بلیٹن بورڈ کوڈ") ایک ہلکی مارک اپ زبان ہے جو بہت سے انٹرنیٹ فورم سافٹ ویئر میں پیغامات کو فارمیٹ کرنے کے لیے استعمال ہوتی ہے۔',
    link: '<1><tag-2>bbcode.org</tag-2></tag-1> <tag-3> <tag-4>بی بی کوڈ گائیڈ</tag-4> </tag-3> <tag-5> <tag-6>ویکیپیڈیا پر بی بی کوڈ</tag-6> </tag-5>',
    name: 'بی بی کوڈ',
  },
  blockly: {
    desc: 'بصری پروگرامنگ ایڈیٹرز بنانے کے لیے ایک جاوا اسکرپٹ لائبریری۔',
    link: '<1> <tag-2>سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>رہنما</tag-4> </tag-3> <tag-5> <tag-6>حوالہ</tag-6> </tag-5> <tag-7> <tag-8>نمونے</tag-8> </tag-7> <tag-9> <tag-10>ابتدائی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'بلاکلی',
  },
  civet: {
    desc: 'سیوٹ ایک پروگرامنگ زبان ہے جو ٹائپ اسکرپٹ یا جاوا اسکرپٹ میں کمپائل ہوتی ہے، تاکہ آپ موجودہ ٹولنگ استعمال کر سکیں لیکن مختصر اور طاقتور نحو کو فعال کر سکیں۔',
    link: '<1> <tag-2>سیوٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>سیوٹ چیٹ شیٹ</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'سیوٹ',
  },
  clio: {
    desc: 'کلیو ایک تیز، تقسیم شدہ، فنکشنل پروگرامنگ زبان ہے جو جاوا اسکرپٹ میں کمپائل ہوتی ہے۔',
    link: '<1> <tag-2>کلیو کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>کلیو کی دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'کلیو',
  },
  clojurescript: {
    desc: 'کلوجر اسکرپٹ <1>کلوجر</tag-1> کے لیے ایک کمپائلر ہے جو جاوا اسکرپٹ کو ہدف بناتا ہے۔ <tag-2></tag-2>لائیو کوڈز میں، یہ براؤزر میں <tag-3>چیری</tag-3> کا استعمال کرتے ہوئے چلتا ہے۔',
    link: '<1> <tag-2>کلوجر اسکرپٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>کلوجر کی سرکاری ویب سائٹ</tag-4> </tag-3> <tag-5> <tag-6>چیری ریپوزٹری</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=کلوجر</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'کلوجر اسکرپٹ (سی ایل جے ایس)',
  },
  coffeescript: {
    desc: 'سادہ جاوا اسکرپٹ۔',
    link: '<1> <tag-2>کافی اسکرپٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>X کو Y منٹ میں سیکھیں، جہاں X=کافی اسکرپٹ</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'کافی اسکرپٹ',
  },
  commonlisp: {
    desc: 'جے ایس سی ایل (کامن لسپ سے بوٹ سٹریپ کیا گیا لسپ-ٹو-جاوا اسکرپٹ کمپائلر) کا استعمال کرتے ہوئے جاوا اسکرپٹ پر کامن لسپ کا نفاذ۔',
    link: '<1> <tag-2>کامن-لسپ.نیٹ</tag-2> </tag-1> <tag-3> <tag-4>جے ایس سی ایل پروجیکٹ</tag-4> </tag-3> <tag-5> <tag-6>کامن لسپ وسائل</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=کامن لسپ</tag-8> </tag-7> <tag-9> <tag-10>ابتدائی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'کامن لسپ',
  },
  cpp: {
    desc1:
      'جے ایس سی پی پی (جاوا اسکرپٹ میں لکھا گیا ایک سادہ سی++ انٹرپریٹر) کا استعمال کرتے ہوئے سی++ کی معاونت۔',
    desc2:
      'یہ سی++ کا مکمل نفاذ نہیں ہے۔ تفصیلات کے لیے براہ کرم <1>جے ایس سی پی پی دستاویزات</tag-1> سے رجوع کریں۔',
    link: '<1> <tag-2>معیاری سی++ فاؤنڈیشن</tag-2> </tag-1> <tag-3> <tag-4>جے ایس سی پی پی</tag-4> </tag-3> <tag-5> <tag-6>X کو Y منٹ میں سیکھیں، جہاں X=سی++</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'سی++',
  },
  cppWasm: {
    desc: 'ویب اسمبلی پر چلنے والا کلینگ سی/سی++ کمپائلر، <1>ڈبلیو اے ایس ایم-کلینگ</tag-1> کا استعمال کرتے ہوئے جسے <tag-2>پولی لینگ.آئی او</tag-2> نے اپنایا ہے۔',
    link: '<1> <tag-2>معیاری سی++ فاؤنڈیشن</tag-2> </tag-1> <tag-3> <tag-4>کلینگ کی سرکاری ویب سائٹ</tag-4> </tag-3> <tag-5> <tag-6>X کو Y منٹ میں سیکھیں، جہاں X=سی++</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'سی/سی++ (ڈبلیو اے ایس ایم)',
  },
  diagrams: {
    desc1: '(تجرباتی)',
    desc2: 'کوڈ کے طور پر خاکے۔ معاونت کرتا ہے:',
    desc3:
      '<1> <tag-2>سائٹو اسکیپ</tag-2> </tag-1> <tag-3> <tag-4>ای ایل کے</tag-4> (<tag-5>ایلک جے ایس</tag-5> کا استعمال کرتے ہوئے) </tag-3> <tag-6> <tag-7>جی این یو پلاٹ</tag-7> (<tag-8>جی این یو پلاٹ-جے ایس</tag-8> کا استعمال کرتے ہوئے) </tag-6> <tag-9> <tag-10>گراف وز</tag-10> (<tag-11>@ایچ پی سی سی-جے ایس/ڈبلیو اے ایس ایم</tag-11> کا استعمال کرتے ہوئے) </tag-9> <tag-12> <tag-13>مرمیڈ</tag-13> </tag-12> <tag-14> <tag-15>نوم نوم ایل</tag-15> </tag-14> <tag-16> <tag-17>پنٹورا</tag-17> </tag-16> <tag-18> <tag-19>پلاٹلی</tag-19> </tag-18> <tag-20> <tag-21>ایس وی جی باب</tag-21> </tag-20> <tag-22> <tag-23>ویگا</tag-23> </tag-22> <tag-24> <tag-25>ویگا لائٹ</tag-25> </tag-24> <tag-26> <tag-27>ویو ڈروم</tag-27> </tag-26>',
    link: '<1> <tag-2>ابتدائی سانچہ لوڈ کریں</tag-2> </tag-1> <tag-3> <tag-4>لائیو کوڈز دستاویزات</tag-4> </tag-3>',
    name: 'خاکے',
  },
  dot: {
    desc: 'نوڈ.جے ایس اور براؤزرز کے لیے سب سے تیز + مختصر جاوا اسکرپٹ ٹیمپلیٹ انجن۔',
    link: '<1> <tag-2>سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>لائیو کوڈز دستاویزات</tag-4> </tag-3>',
    name: 'ڈاٹ.جے ایس',
  },
  ejs: {
    desc: 'ایمبیڈڈ جاوا اسکرپٹ ٹیمپلیٹنگ۔',
    link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>لائیو کوڈز دستاویزات</tag-4> </tag-3>',
    name: 'ای جے ایس',
  },
  eta: {
    desc: 'نوڈ، ڈینو، اور براؤزر کے لیے ایمبیڈڈ جے ایس ٹیمپلیٹ انجن۔ ہلکا، تیز، اور پلگ ایبل۔ ٹائپ اسکرپٹ میں لکھا گیا۔',
    link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>لائیو کوڈز دستاویزات</tag-6> </tag-5>',
    name: 'ایٹا',
  },
  fennel: {
    desc: 'فینل ایک پروگرامنگ زبان ہے جو لوا کی رفتار، سادگی اور پہنچ کو لسپ نحو اور میکرو سسٹم کی لچک کے ساتھ جمع کرتی ہے۔',
    link: '<1> <tag-2>فینل کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>فینل کے ساتھ شروعات</tag-4> </tag-3> <tag-5> <tag-6>لائیو کوڈز دستاویزات</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'فینل',
  },
  flow: {
    desc: 'فلو جاوا اسکرپٹ کے لیے ایک اسٹیٹک ٹائپ چیکر ہے۔',
    link: '<1> <tag-2>فلو کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>فلو کی دستاویزات</tag-4> </tag-3>',
    name: 'فلو',
  },
  gleam: {
    desc1: 'گلیم ٹائپ-محفوظ نظام بنانے کے لیے ایک دوستانہ زبان ہے جو پیمانہ بناتی ہے!',
    desc2:
      'گلیم ایک اسٹیٹکلی-ٹائپڈ فنکشنل پروگرامنگ زبان ہے، جو ارلانگ یا جاوا اسکرپٹ میں کمپائل ہوتی ہے۔',
    link: '<1><tag-2>گلیم ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>گلیم دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>گلیم زبان کا دورہ</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'گلیم',
  },
  go: {
    desc1:
      'گو (گولانگ) ایک اوپن سورس پروگرامنگ زبان ہے جو سادہ، قابل اعتماد، اور موثر سافٹ ویئر بنانے کو آسان بناتی ہے۔',
    desc2: 'یہاں، یہ گوفر جے ایس کا استعمال کرتے ہوئے جاوا اسکرپٹ میں کمپائل کیا جاتا ہے۔',
    link: '<1><tag-2>گو ویب سائٹ</tag-2></tag-1> <tag-3><tag-4>گو دستاویزات</tag-4></tag-3> <tag-5> <tag-6>گوفر جے ایس ریپو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=گو</tag-8> </tag-7> <tag-9><tag-10>ابتدائی سانچہ لوڈ کریں</tag-10></tag-9>',
    name: 'گو',
  },
  haml: {
    desc: 'کلائنٹ سائیڈ جاوا اسکرپٹ ویو ٹیمپلیٹس کے لیے کلائنٹ سائیڈ-ہیمل-جے ایس کا استعمال کرتے ہوئے ہیمل کمپائلر۔',
    link: '<1><tag-2>ہیمل کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>ہیمل دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>کلائنٹ سائیڈ-ہیمل-جے ایس گٹ ہب ریپو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=ہیمل</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9>',
    name: 'ہیمل',
  },
  handlebars: {
    desc: 'اسٹیرائڈز پر کم از کم ٹیمپلیٹنگ۔',
    link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>لائیو کوڈز دستاویزات</tag-4> </tag-3>',
    name: 'ہینڈل بارز',
  },
  imba: {
    desc: 'دوستانہ فل-اسٹیک زبان۔',
    link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1>',
    name: 'امبا',
  },
  jsx: {
    desc: 'جے ایس ایکس کو لائیو کوڈز میں ٹائپ اسکرپٹ کمپائلر کا استعمال کرتے ہوئے جاوا اسکرپٹ میں کمپائل کیا جاتا ہے۔ ڈیفالٹ طور پر یہ جے ایس ایکس رن ٹائم کے طور پر ری ایکٹ کا استعمال کرتا ہے۔',
    link: '<1> <tag-2>ری ایکٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ری ایکٹ دستاویزات میں جے ایس ایکس</tag-4> </tag-3> <tag-5> <tag-6>لائیو کوڈز دستاویزات</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'جے ایس ایکس',
  },
  julia: {
    desc1: '(لائیو کوڈز میں جولیا زبان کی معاونت ابھی بھی تجرباتی ہے)',
    desc2:
      'ڈبلیو اے ایس ایم پر چلنے والا جولیا کمپائلر اور جولیا بیس، <1>جولیا-ڈبلیو اے ایس ایم</tag-1> کا استعمال کرتے ہوئے جسے <tag-2>پولی لینگ.آئی او</tag-2> نے اپنایا ہے۔',
    link: '<1> <tag-2>جولیا کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>جولیا دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>X کو Y منٹ میں سیکھیں، جہاں X=جولیا</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'جولیا',
  },
  less: {
    desc: 'یہ سی ایس ایس ہے، بس تھوڑا سا زیادہ کے ساتھ۔',
    link: '<1><tag-2>لیس کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>X کو Y منٹ میں سیکھیں، جہاں X=لیس</tag-4> </tag-3>',
    name: 'لیس',
  },
  liquid: {
    desc: 'ایک سادہ، اظہاری اور محفوظ ٹیمپلیٹ انجن۔',
    link: '<1> <tag-2>لیکوڈ جے ایس کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>لیکوڈ جے ایس دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>لائیو کوڈز دستاویزات</tag-6> </tag-5>',
    name: 'لیکوڈ جے ایس',
  },
  livescript: {
    desc: 'ایک زبان جو جاوا اسکرپٹ میں کمپائل ہوتی ہے۔',
    link: '<1> <tag-2>لائیو اسکرپٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>X کو Y منٹ میں سیکھیں، جہاں X=لائیو اسکرپٹ</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'لائیو اسکرپٹ',
  },
  lua: {
    desc: 'فینگاری-ویب کا استعمال کرتے ہوئے براؤزر میں چلنے والا لوا۔',
    link: '<1><tag-2>لوا کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>لوا دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>فینگاری کی سرکاری ویب سائٹ</tag-6> </tag-5> <tag-7> <tag-8>فینگاری-ویب گٹ ہب ریپو</tag-8> </tag-7> <tag-9> <tag-10>X کو Y منٹ میں سیکھیں، جہاں X=لوا</tag-10> </tag-9> <tag-11> <tag-12>لائیو کوڈز دستاویزات</tag-12> </tag-11> <tag-13><tag-14>ابتدائی سانچہ لوڈ کریں</tag-14></tag-13>',
    name: 'لوا',
  },
  luaWasm: {
    desc: 'واسمون کا استعمال کرتے ہوئے براؤزر میں چلنے والا لوا، جو ویب اسمبلی کے ساتھ بنایا گیا جے ایس بائنڈنگز والا ایک حقیقی لوا 5.4 وی ایم ہے۔',
    link: '<1><tag-2>لوا کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>لوا دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>واسمون گٹ ہب ریپو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=لوا</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'لوا (ڈبلیو اے ایس ایم)',
  },
  malina: {
    desc: 'سویلٹ سے متاثر فرنٹ اینڈ کمپائلر۔',
    link: '<1> <tag-2>ملینا.جے ایس ریپو</tag-2> </tag-1> <tag-3> <tag-4>ملینا.جے ایس دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'ملینا.جے ایس',
  },
  markdown: {
    desc: 'مارکڈ کا استعمال کرتے ہوئے مارک ڈاؤن کو ایچ ٹی ایم ایل میں کمپائل کیا گیا۔',
    link: '<1> <tag-2>مارک ڈاؤن کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>مارکڈ دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>X کو Y منٹ میں سیکھیں، جہاں X=مارک ڈاؤن</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'مارک ڈاؤن',
  },
  mdx: {
    desc: 'کمپوننٹ دور کے لیے مارک ڈاؤن۔ <1></tag-1>ایم ڈی ایکس آپ کو اپنے مارک ڈاؤن دستاویزات میں آسانی سے جے ایس ایکس لکھنے کی اجازت دیتا ہے۔',
    link: '<1><tag-2>ایم ڈی ایکس دستاویزات</tag-2></tag-1> <tag-3><tag-4>ابتدائی سانچہ لوڈ کریں</tag-4></tag-3>',
    name: 'ایم ڈی ایکس',
  },
  mjml: {
    desc: 'ایم جے ایم ایل ایک مارک اپ زبان ہے جو ریسپانسیو ای میل کوڈنگ کی تکلیف کو کم کرنے کے لیے ڈیزائن کی گئی ہے۔',
    link: '<1><tag-2>ایم جے ایم ایل کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>ایم جے ایم ایل دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ایم جے ایم ایل کے سرکاری سانچے</tag-6> </tag-5> <tag-7> <tag-8>لائیو کوڈز دستاویزات</tag-8> </tag-7>',
    name: 'ایم جے ایم ایل',
  },
  mustache: {
    desc: 'منطق سے پاک سانچے۔',
    link: '<1> <tag-2>سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>مسٹیش(5) مینوئل</tag-4> </tag-3> <tag-5> <tag-6>جاوا اسکرپٹ نفاذ</tag-6> </tag-5> <tag-7> <tag-8>لائیو کوڈز دستاویزات</tag-8> </tag-7>',
    name: 'مسٹیش',
  },
  nunjucks: {
    desc: 'جاوا اسکرپٹ کے لیے ایک امیر اور طاقتور ٹیمپلیٹنگ زبان۔ نن جکس بنیادی طور پر <1>جنجا2</tag-1> کا ایک پورٹ ہے۔',
    link: '<1> <tag-2>سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>لائیو کوڈز دستاویزات</tag-4> </tag-3>',
    name: 'نن جکس',
  },
  ocaml: {
    desc1:
      'او کیمل ایک صنعتی طاقت کی پروگرامنگ زبان ہے جو فنکشنل، امپیریٹیو اور آبجیکٹ اورینٹڈ طرزوں کی معاونت کرتی ہے۔',
    desc2:
      'یہاں او کیمل کو جاوا اسکرپٹ میں کمپائل کرنے کے لیے ری اسکرپٹ کمپائلر کا استعمال کیا جاتا ہے۔',
    link: '<1><tag-2>او کیمل ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>او کیمل دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ری اسکرپٹ ویب سائٹ</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=او کیمل</tag-8> </tag-7> <tag-9> <tag-10>ابتدائی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'او کیمل',
  },
  perl: {
    desc: 'پرلیٹو کا استعمال کرتے ہوئے براؤزر میں چلنے والا پرل۔',
    link: '<1> <tag-2>پرل کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>پرل دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>پرلیٹو5 ریڈمی</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=پرل</tag-8> </tag-7> <tag-9> <tag-10>ابتدائی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'پرل',
  },
  php: {
    desc: 'یونائٹر کا استعمال کرتے ہوئے براؤزر میں چلنے والا پی ایچ پی۔',
    link: '<1><tag-2>پی ایچ پی کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>پی ایچ پی دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>یونائٹر گٹ ہب ریپو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=پی ایچ پی</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11><tag-12>ابتدائی سانچہ لوڈ کریں</tag-12></tag-11>',
    name: 'پی ایچ پی',
  },
  phpWasm: {
    desc: 'پی ایچ پی-ڈبلیو اے ایس ایم کا استعمال کرتے ہوئے، ویب اسمبلی کے ذریعے براؤزر میں پی ایچ پی۔',
    link: '<1><tag-2>پی ایچ پی کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>پی ایچ پی دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>پی ایچ پی-ڈبلیو اے ایس ایم گٹ ہب ریپو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=پی ایچ پی</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'پی ایچ پی (ڈبلیو اے ایس ایم)',
  },
  postgresql: {
    desc: 'پی جی لائٹ کا استعمال کرتے ہوئے ڈبلیو اے ایس ایم کے طور پر پیکیج کیا گیا پوسٹگریس کیو ایل',
    link: '<1> <tag-2>پوسٹگریس کیو ایل کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>پوسٹگریس کیو ایل دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>پی جی لائٹ گٹ ہب ریپو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=ایس کیو ایل</tag-8> </tag-7> <tag-9> <tag-10>ابتدائی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'پوسٹگریس کیو ایل',
  },
  prolog: {
    desc: 'جاوا اسکرپٹ میں ایک اوپن سورس پرولوگ انٹرپریٹر۔',
    link: '<1> <tag-2>ٹاؤ پرولوگ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ٹاؤ پرولوگ دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ایس ڈبلیو آئی-پرولوگ</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=پرولوگ</tag-8> </tag-7> <tag-9> <tag-10>ابتدائی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'ٹاؤ پرولوگ',
  },
  pug: {
    desc: 'مضبوط، شاندار، خصوصیات سے بھرپور ٹیمپلیٹ انجن۔',
    link: '<1> <tag-2>پگ دستاویزات</tag-2> </tag-1> <tag-3> <tag-4>X کو Y منٹ میں سیکھیں، جہاں X=پگ</tag-4> </tag-3> <tag-5> <tag-6>لائیو کوڈز دستاویزات</tag-6> </tag-5>',
    name: 'پگ',
  },
  python: {
    desc: 'برائٹھن کا استعمال کرتے ہوئے براؤزر میں چلنے والا پائتھن۔',
    link: '<1> <tag-2>پائتھن کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>پائتھن دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>برائٹھن دستاویزات</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=پائتھن</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'پائتھن',
  },
  pythonWasm: {
    desc1: 'پایوڈائڈ کا استعمال کرتے ہوئے ویب اسمبلی میں کمپائل کردہ سائنسی اسٹیک کے ساتھ پائتھن۔',
    desc2:
      'پایوڈائڈ نمپی، پانڈاز، میٹ پلاٹ لب، سائپی، سائکٹ-لرن اور بہت کچھ سمیت پائتھن سائنسی اسٹیک کو استعمال کرنے کی اجازت دیتا ہے۔ اس کے علاوہ پی وائی پی آئی سے خالص پائتھن وہیلز کو انسٹال کرنا ممکن ہے۔',
    link: '<1> <tag-2>پائتھن کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>پائتھن دستاویزات</tag-4> </tag-3> <tag-5><tag-6>پایوڈائڈ دستاویزات</tag-6></tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=پائتھن</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'پائتھن (ڈبلیو اے ایس ایم)',
  },
  r: {
    desc: 'ویب آر کا استعمال کرتے ہوئے براؤزر میں چلنے والا آر۔',
    link: '<1> <tag-2>آر پروجیکٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>آر مینوئلز</tag-4> </tag-3> <tag-5> <tag-6>ڈیٹا سائنس کے لیے آر (دوسرا ایڈیشن)</tag-6> </tag-5> <tag-7> <tag-8>ویب آر دستاویزات</tag-8> </tag-7> <tag-9> <tag-10>X کو Y منٹ میں سیکھیں، جہاں X=آر</tag-10> </tag-9> <tag-11> <tag-12>لائیو کوڈز دستاویزات</tag-12> </tag-11> <tag-13> <tag-14>ابتدائی سانچہ لوڈ کریں</tag-14> </tag-13>',
    name: 'آر',
  },
  reactNative: {
    desc: 'ری ایکٹ نیٹیو فار ویب ری ایکٹ نیٹیو کے اجزاء اور اے پی آئیز کا ایک قابل رسائی نفاذ ہے جو ری ایکٹ ڈی او ایم کے ساتھ باہمی تعامل کرنے والا ہے۔',
    link: '<1> <tag-2>ری ایکٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ری ایکٹ نیٹیو ویب سائٹ</tag-4> </tag-3> <tag-5> <tag-6>ری ایکٹ نیٹیو فار ویب ویب سائٹ</tag-6> </tag-5> <tag-7> <tag-8>ری ایکٹ نیٹیو دستاویزات</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'ری ایکٹ نیٹیو فار ویب',
  },
  reactNativeTsx: {
    desc: 'ری ایکٹ نیٹیو فار ویب ری ایکٹ نیٹیو کے اجزاء اور اے پی آئیز کا ایک قابل رسائی نفاذ ہے جو ری ایکٹ ڈی او ایم کے ساتھ باہمی تعامل کرنے والا ہے۔',
    link: '<1> <tag-2>ری ایکٹ کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ری ایکٹ نیٹیو ویب سائٹ</tag-4> </tag-3> <tag-5> <tag-6>ری ایکٹ نیٹیو فار ویب ویب سائٹ</tag-6> </tag-5> <tag-7> <tag-8>ری ایکٹ نیٹیو دستاویزات</tag-8> </tag-7> <tag-9> <tag-10>ٹائپ اسکرپٹ ویب سائٹ</tag-10> </tag-9> <tag-11> <tag-12>ٹائپ اسکرپٹ دستاویزات</tag-12> </tag-11> <tag-13> <tag-14>لائیو کوڈز دستاویزات</tag-14> </tag-13> <tag-15> <tag-16>ابتدائی سانچہ لوڈ کریں (جے ایس ایکس)</tag-16> </tag-15>',
    name: 'ری ایکٹ نیٹیو فار ویب (ٹائپ اسکرپٹ کے ساتھ)',
  },
  reason: {
    desc1:
      'ریزن آپ کو جاوا اسکرپٹ اور او کیمل دونوں ماحولیاتی نظاموں کا فائدہ اٹھاتے ہوئے سادہ، تیز اور معیاری قسم محفوظ کوڈ لکھنے کی اجازت دیتا ہے۔',
    desc2:
      'یہاں ریزن کو جاوا اسکرپٹ میں کمپائل کرنے کے لیے ری اسکرپٹ کمپائلر کا استعمال کیا جاتا ہے۔',
    link: '<1><tag-2>ریزن ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>ریزن دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ریزن ری ایکٹ</tag-6> </tag-5> <tag-7> <tag-8>ری اسکرپٹ ویب سائٹ</tag-8> </tag-7> <tag-9> <tag-10>X کو Y منٹ میں سیکھیں، جہاں X=ریزن</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
    name: 'ریزن',
  },
  rescript: {
    desc: 'ری اسکرپٹ ایک مضبوطی سے ٹائپ کی گئی زبان ہے جو موثر اور انسانی پڑھنے کے قابل جاوا اسکرپٹ میں کمپائل ہوتی ہے۔',
    link: '<1> <tag-2>ری اسکرپٹ ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ری اسکرپٹ / ری ایکٹ</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'ری اسکرپٹ',
  },
  richtext: {
    desc1: 'کوئل کا استعمال کرتے ہوئے:',
    desc2: 'آپ کا طاقتور رچ ٹیکسٹ ایڈیٹر۔',
    link: '<1> <tag-2>کوئل کی سرکاری ویب سائٹ</tag-2> </tag-1>',
    name: 'رچ ٹیکسٹ ایڈیٹر',
  },
  riot: {
    desc: 'سادہ اور خوبصورت کمپوننٹ پر مبنی یو آئی لائبریری۔',
    link: '<1> <tag-2>رائٹ.جے ایس کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>رائٹ.جے ایس دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ابتدائی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'رائٹ.جے ایس',
  },
  ruby: {
    desc: 'اوپال کا استعمال کرتے ہوئے براؤزر میں چلنے والا روبی۔',
    link: '<1> <tag-2>روبی کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>روبی دستاویزات</tag-4> </tag-3> <tag-5><tag-6>اوپال کی سرکاری ویب سائٹ</tag-6></tag-5> <tag-7> <tag-8>اوپال معیاری لائبریری سی ڈی این</tag-8> </tag-7> <tag-9> <tag-10>X کو Y منٹ میں سیکھیں، جہاں X=روبی</tag-10> </tag-9> <tag-11> <tag-12>لائیو کوڈز دستاویزات</tag-12> </tag-11> <tag-13> <tag-14>ابتدائی سانچہ لوڈ کریں</tag-14> </tag-13>',
    name: 'روبی',
  },
  rubyWasm: {
    desc: 'روبی-ڈبلیو اے ایس ایم (سی روبی کے ویب اسمبلی پورٹس کا ایک مجموعہ) کا استعمال کرتے ہوئے براؤزر میں چلنے والا روبی۔',
    link: '<1> <tag-2>روبی کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>روبی دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>روبی.ڈبلیو اے ایس ایم ویب سائٹ</tag-6> </tag-5> <tag-7><tag-8>سی روبی</tag-8></tag-7> <tag-9> <tag-10>X کو Y منٹ میں سیکھیں، جہاں X=روبی</tag-10> </tag-9> <tag-11> <tag-12>لائیو کوڈز دستاویزات</tag-12> </tag-11> <tag-13> <tag-14>ابتدائی سانچہ لوڈ کریں</tag-14> </tag-13>',
    name: 'روبی (ڈبلیو اے ایس ایم)',
  },
  sass: {
    desc: 'نحوی طور پر شاندار اسٹائل شیٹس۔',
    link: '<1> <tag-2>ساس کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ساس دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ساس (انڈینٹڈ) نحو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=ساس</tag-8> </tag-7>',
    name: 'ساس',
  },
  scheme: {
    desc: 'بیوا اسکیم کا استعمال کرتے ہوئے براؤزر میں چلنے والا اسکیم۔',
    link: '<1> <tag-2>اسکیم پروگرامنگ زبان</tag-2> </tag-1> <tag-3> <tag-4>بیوا اسکیم کی سرکاری ویب سائٹ</tag-4> </tag-3> <tag-5> <tag-6>بیوا اسکیم حوالہ</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'اسکیم',
  },
  scss: {
    desc: 'نحوی طور پر شاندار اسٹائل شیٹس۔',
    link: '<1> <tag-2>ساس کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>ساس دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ایس سی ایس ایس نحو</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=ساس</tag-8> </tag-7>',
    name: 'ایس سی ایس ایس',
  },
  solid: {
    desc: 'صارف انٹرفیس بنانے کے لیے ایک اعلانیہ، موثر اور لچکدار جاوا اسکرپٹ لائبریری۔',
    link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1> <tag-3><tag-4>دستاویزات</tag-4></tag-3> <tag-5> <tag-6>لائیو کوڈز دستاویزات</tag-6> </tag-5> <tag-7> <tag-8>ابتدائی سانچہ لوڈ کریں (ٹی ایس ایکس)</tag-8> </tag-7>',
    name: 'سولڈ',
    tsx: {
      desc: 'صارف انٹرفیس بنانے کے لیے ایک اعلانیہ، موثر اور لچکدار جاوا اسکرپٹ لائبریری۔',
      link: '<1><tag-2>سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>سولڈ دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>ٹائپ اسکرپٹ ویب سائٹ</tag-6> </tag-5> <tag-7> <tag-8>ٹائپ اسکرپٹ دستاویزات</tag-8> </tag-7> <tag-9> <tag-10>لائیو کوڈز دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>ابتدائی سانچہ لوڈ کریں</tag-12> </tag-11>',
      name: 'سولڈ (ٹائپ اسکرپٹ کے ساتھ)',
    },
  },
  sql: {
    desc: 'SQL.js کا استعمال کرتے ہوئے جاوا اسکرپٹ میں مرتب کیا گیا SQLite',
    link: '<1> <tag-2>SQLite کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>SQLite سنٹیکس دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>SQL.js کی سرکاری ویب سائٹ</tag-6> </tag-5> <tag-7> <tag-8>X کو Y منٹ میں سیکھیں، جہاں X=SQL</tag-8> </tag-7> <tag-9><tag-10>شروعاتی سانچہ لوڈ کریں</tag-10></tag-9>',
    name: 'SQLite',
  },
  stencil: {
    desc: 'ویب کمپوننٹس اور اعلی کارکردگی والی ویب ایپس کے لیے ایک کمپائلر۔',
    link: '<1> <tag-2>Stencil کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>Stencil دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>شروعاتی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'Stencil',
  },
  styleProcessors: {
    link: '<1> <tag-2>Tailwind CSS</tag-2> </tag-1> <tag-3> <tag-4>Windi CSS</tag-4> </tag-3> <tag-5> <tag-6>UnoCSS</tag-6> </tag-5> <tag-7> <tag-8>Lightning CSS</tag-8> </tag-7> <tag-9> <tag-10>PostCSS</tag-10> پلگ انز: <tag-11> <tag-12> <tag-13>Autoprefixer</tag-13> </tag-12> <tag-14> <tag-15>postcss-preset-env</tag-15> </tag-14> <tag-16> <tag-17>postcss-import-url</tag-17> </tag-16> <tag-18> <tag-19>postcss-modules</tag-19> </tag-18> </tag-11> </tag-9>',
    name: 'CSS فریم ورکس اور پروسیسرز',
  },
  stylis: {
    desc: 'ہلکا وزن سی ایس ایس پری پروسیسر۔',
    link: '<1> <tag-2>Stylis کی سرکاری ویب سائٹ</tag-2> </tag-1>',
    name: 'Stylis',
  },
  stylus: {
    desc: 'اظہاری، متحرک، مضبوط CSS۔',
    link: '<1> <tag-2>Stylus کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>X کو Y منٹ میں سیکھیں، جہاں X=stylus</tag-4> </tag-3>',
    name: 'Stylus',
  },
  sucrase: {
    desc: 'جب آپ جدید JS رن ٹائمز کو ہدف بنا سکتے ہیں تو Babel کا انتہائی تیز متبادل۔',
    link: '<1> <tag-2>Sucrase کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>Sucrase GitHub ریپو</tag-4> </tag-3> <tag-5> <tag-6>LiveCodes دستاویزات</tag-6> </tag-5>',
    name: 'Sucrase',
  },
  svelte: {
    desc: 'سائبرنیٹک طور پر بہتر ویب ایپس۔',
    link: '<1> <tag-2>Svelte کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>Svelte دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>شروعاتی سانچہ لوڈ کریں</tag-6> </tag-5>',
    name: 'Svelte',
  },
  tcl: {
    desc: '<1>wacl</tag-1> کا استعمال کرتے ہوئے براؤزر میں چلنے والی Tcl۔',
    link: '<1> <tag-2>Tcl کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>wacl ریپو</tag-4> </tag-3> <tag-5> <tag-6>X کو Y منٹ میں سیکھیں، جہاں X=Tcl</tag-6> </tag-5> <tag-7> <tag-8>شروعاتی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'Tcl (ٹول کمانڈ لینگویج)',
  },
  teal: {
    desc: 'Lua کی ایک ٹائپ کردہ بولی۔',
    link: '<1> <tag-2>Teal GitHub ریپو</tag-2> </tag-1> <tag-3> <tag-4>Teal دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>Teal ٹیوٹوریل</tag-6> </tag-5> <tag-7> <tag-8>LiveCodes دستاویزات</tag-8> </tag-7> <tag-9> <tag-10>شروعاتی سانچہ لوڈ کریں</tag-10> </tag-9>',
    name: 'Teal',
  },
  tsx: {
    desc: 'JSX میں TypeScript۔ TSX کو LiveCodes میں TypeScript کمپائلر کا استعمال کرتے ہوئے جاوا اسکرپٹ میں مرتب کیا جاتا ہے۔ ڈیفالٹ طور پر یہ JSX رن ٹائم کے طور پر React کا استعمال کرتا ہے۔',
    link: '<1> <tag-2>React کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>React میں JSX دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>Typescript دستاویزات</tag-6> </tag-5> <tag-7> <tag-8>LiveCodes دستاویزات</tag-8> </tag-7>',
    name: 'TSX',
  },
  twig: {
    desc: '<2>Twig.js</tag-2> کے ذریعے <tag-1>Twig</tag-1> PHP ٹیمپلیٹنگ زبان کا ایک جاوا اسکرپٹ نفاذ۔',
    link: '<1> <tag-2>Twig کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>Twig دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>Twig.js ریپو</tag-6> </tag-5> <tag-7> <tag-8>Twig.js دستاویزات</tag-8> </tag-7> <tag-9> <tag-10>LiveCodes دستاویزات</tag-10> </tag-9>',
    name: 'Twig',
  },
  typescript: {
    desc: 'جاوا اسکرپٹ کا ایک ٹائپ کردہ سپر سیٹ۔',
    link: '<1> <tag-2>سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>TypeScript دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>X کو Y منٹ میں سیکھیں، جہاں X=TypeScript</tag-6> </tag-5> <tag-7> <tag-8>شروعاتی سانچہ لوڈ کریں</tag-8> </tag-7>',
    name: 'TypeScript',
  },
  vue: {
    link: '<1> <tag-2>Vue.js v3 کی سرکاری ویب سائٹ</tag-2> </tag-1> <tag-3> <tag-4>Vue3 دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>Vue3 سنگل فائل کمپوننٹس</tag-6> </tag-5> <tag-7> <tag-8>LiveCodes دستاویزات</tag-8> </tag-7> <tag-9><tag-10>شروعاتی سانچہ لوڈ کریں</tag-10></tag-9>',
    name: 'Vue3 سنگل فائل کمپوننٹس',
  },
  vue2: {
    desc: 'vue3-sfc-loader کا استعمال کرتے ہوئے لوڈ کیا گیا۔',
    link: '<1><tag-2>Vue.js کی سرکاری ویب سائٹ</tag-2></tag-1> <tag-3> <tag-4>Vue2 دستاویزات</tag-4> </tag-3> <tag-5> <tag-6>Vue2 سنگل فائل کمپوننٹس</tag-6> </tag-5> <tag-7> <tag-8>vue3-sfc-loader GitHub ریپو</tag-8> </tag-7> <tag-9> <tag-10>LiveCodes دستاویزات</tag-10> </tag-9>',
    name: 'Vue2 سنگل فائل کمپوننٹس',
  },
  wat: {
    desc1: 'WebAssembly (wasm) بائنری فارمیٹ کی کم سطحی متنی نمائندگی۔',
    desc2: 'یہ wabt.js کا استعمال کرتے ہوئے wasm میں تبدیل کیا جاتا ہے۔',
    link: '<1><tag-2>WebAssembly.org</tag-2></tag-1> <tag-3> <tag-4>WebAssembly ٹیکسٹ اسپیکس</tag-4> </tag-3> <tag-5> <tag-6>MDN پر WebAssembly</tag-6> </tag-5> <tag-7> <tag-8>WebAssembly ٹیکسٹ فارمیٹ کو سمجھنا</tag-8> </tag-7> <tag-9> <tag-10>wabt.js دستاویزات</tag-10> </tag-9> <tag-11> <tag-12>X کو Y منٹ میں سیکھیں، جہاں X=WebAssembly</tag-12> </tag-11> <tag-13><tag-14>شروعاتی سانچہ لوڈ کریں</tag-14></tag-13>',
    name: 'WebAssembly ٹیکسٹ فارمیٹ',
  },
};

export default languageInfo;
