// ATTENTION: This file is auto-generated from source code. Do not edit manually!

import type { I18nLangInfoTranslation } from '../models';

const languageInfo: I18nLangInfoTranslation = {
  artTemplate: {
    desc: 'উচ্চ কর্মক্ষমতা সম্পন্ন JavaScript টেমপ্লেটিং ইঞ্জিন।',
    link: '<1> <2>art-template অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>art-template ডকুমেন্টেশন</4> </3>',
    name: 'art-template',
  },
  asciidoc: {
    desc: 'Asciidoctor ব্যবহার করে HTML-এ কম্পাইল করা AsciiDoc।',
    link: '<1> <2>AsciiDoc অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Asciidoctor অফিসিয়াল ওয়েবসাইট</4> </3> <5> <6>Asciidoctor ডকুমেন্টেশন</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=asciidoc</8> </7>',
    name: 'AsciiDoc',
  },
  assemblyscript: {
    desc: 'WebAssembly-এর জন্য TypeScript-এর মতো একটি ভাষা।',
    link: '<1> <2>AssemblyScript অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>AssemblyScript ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'AssemblyScript',
  },
  astro: {
    desc: 'কম ক্লায়েন্ট-সাইড JavaScript দিয়ে দ্রুত ওয়েবসাইট তৈরি করুন। (এখনও বেটায় আছে)',
    link: '<1> <2>Astro অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Astro ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Astro',
  },
  babel: {
    desc: 'JavaScript কম্পাইলার',
    link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Babel ডকুমেন্টেশন</4> </3>',
    name: 'Babel',
  },
  bbcode: {
    desc: 'BBCode ("Bulletin Board Code") একটি লাইটওয়েট মার্কআপ ভাষা যা অনেক ইন্টারনেট ফোরাম সফটওয়্যারে বার্তা ফরম্যাট করতে ব্যবহৃত হয়।',
    link: '<1><2>bbcode.org</2></1> <3> <4>BBCode গাইড</4> </3> <5> <6>উইকিপিডিয়ায় BBCode</6> </5>',
    name: 'BBCode',
  },
  blockly: {
    desc: 'ভিজুয়াল প্রোগ্রামিং এডিটর তৈরির জন্য একটি JavaScript লাইব্রেরি।',
    link: '<1> <2>অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>গাইড</4> </3> <5> <6>রেফারেন্স</6> </5> <7> <8>নমুনা</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Blockly',
  },
  civet: {
    desc: 'Civet একটি প্রোগ্রামিং ভাষা যা TypeScript বা JavaScript-এ কম্পাইল হয়, যাতে আপনি বিদ্যমান টুলিং ব্যবহার করতে পারেন কিন্তু সংক্ষিপ্ত এবং শক্তিশালী সিনট্যাক্স সক্ষম করতে পারেন।',
    link: '<1> <2>Civet অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Civet চিটশিট</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Civet',
  },
  clio: {
    desc: 'Clio একটি দ্রুত, বিতরণকৃত, ফাংশনাল প্রোগ্রামিং ভাষা যা JavaScript-এ কম্পাইল হয়।',
    link: '<1> <2>Clio অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Clio ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Clio',
  },
  clojurescript: {
    desc: 'ClojureScript হলো <1>Clojure</1>-এর জন্য একটি কম্পাইলার যা JavaScript লক্ষ্য করে। <2></2>LiveCodes-এ, এটি <3>Cherry</3> ব্যবহার করে ব্রাউজারে চলে',
    link: '<1> <2>ClojureScript অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Clojure অফিসিয়াল ওয়েবসাইট</4> </3> <5> <6>Cherry রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=clojure</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'ClojureScript (CLJS)',
  },
  coffeescript: {
    desc: 'সাধারণ JavaScript।',
    link: '<1> <2>CoffeeScript অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=coffeescript</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'CoffeeScript',
  },
  commonlisp: {
    desc: 'JSCL (Common Lisp থেকে বুটস্ট্র্যাপ করা Lisp-থেকে-Javascript কম্পাইলার) ব্যবহার করে JavaScript-এ একটি Common Lisp বাস্তবায়ন।',
    link: '<1> <2>Common-Lisp.net</2> </1> <3> <4>JSCL প্রজেক্ট</4> </3> <5> <6>Common Lisp রিসোর্স</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=Common Lisp</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Common Lisp',
  },
  cpp: {
    desc1: 'JSCPP (JavaScript-এ লেখা একটি সাধারণ C++ ইন্টারপ্রেটার) ব্যবহার করে C++ সমর্থন।',
    desc2: 'এটি C++-এর সম্পূর্ণ বাস্তবায়ন নয়। বিস্তারিত জানতে <1>JSCPP ডকুমেন্টেশন</1> দেখুন।',
    link: '<1> <2>Standard C++ Foundation</2> </1> <3> <4>JSCPP</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=C++</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'C++',
  },
  cppWasm: {
    desc: 'WebAssembly-তে চলমান Clang C/C++ কম্পাইলার, <2>polylang.io</2> দ্বারা অভিযোজিত <1>wasm-clang</1> ব্যবহার করে',
    link: '<1> <2>Standard C++ Foundation</2> </1> <3> <4>Clang অফিসিয়াল ওয়েবসাইট</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=C++</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'C/C++ (Wasm)',
  },
  csharpWasm: {
    desc: 'WebAssembly-তে চলমান C# কম্পাইলার, <1>Blazor</1> ব্যবহার করে',
    link: '<1> <2>C# ভাষা ডকুমেন্টেশন</2> </1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=C#</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'C# (Wasm)',
  },
  diagrams: {
    desc1: '(পরীক্ষামূলক)',
    desc2: 'কোড-হিসাবে-ডায়াগ্রাম। সমর্থন করে:',
    desc3:
      '<1> <2>Cytoscape</2> </1> <3> <4>ELK</4> (<5>elkjs</5> ব্যবহার করে) </3> <6> <7>Gnuplot</7> (<8>gnuplot-JS</8> ব্যবহার করে) </6> <9> <10>Graphviz</10> (<11>@hpcc-js/wasm</11> ব্যবহার করে) </9> <12> <13>Mermaid</13> </12> <14> <15>Nomnoml</15> </14> <16> <17>Pintora</17> </16> <18> <19>Plotly</19> </18> <20> <21>Svgbob</21> </20> <22> <23>Vega</23> </22> <24> <25>VegaLite</25> </24> <26> <27>WaveDrom</27> </26>',
    link: '<1> <2>স্টার্টার টেমপ্লেট লোড করুন</2> </1> <3> <4>LiveCodes ডকুমেন্টেশন</4> </3>',
    name: 'ডায়াগ্রাম',
  },
  dot: {
    desc: 'Node.js এবং ব্রাউজারের জন্য সবচেয়ে দ্রুত + সংক্ষিপ্ত javascript টেমপ্লেট ইঞ্জিন।',
    link: '<1> <2>অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>LiveCodes ডকুমেন্টেশন</4> </3>',
    name: 'doT.js',
  },
  ejs: {
    desc: 'এম্বেডেড JavaScript টেমপ্লেটিং।',
    link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>LiveCodes ডকুমেন্টেশন</4> </3>',
    name: 'EJS',
  },
  eta: {
    desc: 'Node, Deno এবং ব্রাউজারের জন্য এম্বেডেড JS টেমপ্লেট ইঞ্জিন। হালকা, দ্রুত এবং প্লাগযোগ্য। TypeScript-এ লেখা।',
    link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>ডকুমেন্টেশন</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5>',
    name: 'Eta',
  },
  fennel: {
    desc: 'Fennel একটি প্রোগ্রামিং ভাষা যা Lua-এর গতি, সরলতা এবং পৌঁছানোকে একটি lisp সিনট্যাক্স এবং ম্যাক্রো সিস্টেমের নমনীয়তার সাথে একত্রিত করে।',
    link: '<1> <2>Fennel অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Fennel দিয়ে শুরু করা</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'Fennel',
  },
  flow: {
    desc: 'Flow হলো JavaScript-এর জন্য একটি স্ট্যাটিক টাইপ চেকার।',
    link: '<1> <2>Flow অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Flow ডকুমেন্টেশন</4> </3>',
    name: 'Flow',
  },
  gleam: {
    desc1: 'Gleam একটি বন্ধুত্বপূর্ণ ভাষা যা টাইপ-সেফ সিস্টেম তৈরির জন্য যা স্কেল করে!',
    desc2:
      'Gleam একটি স্ট্যাটিক্যালি-টাইপড ফাংশনাল প্রোগ্রামিং ভাষা, যা Erlang বা JavaScript-এ কম্পাইল হয়।',
    link: '<1><2>Gleam ওয়েবসাইট</2></1> <3> <4>Gleam ডকুমেন্টেশন</4> </3> <5> <6>Gleam ভাষা ট্যুর</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'Gleam',
  },
  go: {
    desc1:
      'Go (Golang) একটি ওপেন সোর্স প্রোগ্রামিং ভাষা যা সহজ, নির্ভরযোগ্য এবং দক্ষ সফটওয়্যার তৈরি করা সহজ করে।',
    desc2: 'এখানে, এটি GopherJS ব্যবহার করে JavaScript-এ কম্পাইল হয়।',
    link: '<1><2>Go ওয়েবসাইট</2></1> <3><4>Go ডকুমেন্টেশন</4></3> <5> <6>GopherJS রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=Go</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'Go',
  },
  goWasm: {
    desc: 'WebAssembly-তে চলমান Go ইন্টারপ্রেটার, Yaegi ব্যবহার করে',
    link: '<1><2>Go অফিসিয়াল ওয়েবসাইট</2></1> <3><4>Yaegi</4></3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=Go</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Go (Wasm)',
  },
  haml: {
    desc: 'clientside-haml-js ব্যবহার করে ক্লায়েন্ট সাইড javascript ভিউ টেমপ্লেটের জন্য Haml কম্পাইলার।',
    link: '<1><2>Haml অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Haml ডকুমেন্টেশন</4> </3> <5> <6>clientside-haml-js GitHub রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=haml</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9>',
    name: 'Haml',
  },
  handlebars: {
    desc: 'স্টেরয়েডে ন্যূনতম টেমপ্লেটিং।',
    link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>LiveCodes ডকুমেন্টেশন</4> </3>',
    name: 'Handlebars',
  },
  imba: {
    desc: 'বন্ধুত্বপূর্ণ ফুল-স্ট্যাক ভাষা।',
    link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1>',
    name: 'Imba',
  },
  java: {
    desc: 'DoppioJVM ব্যবহার করে ব্রাউজারে চলমান JVM।',
    link: '<1> <2>Java অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>DoppioJVM</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=java</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Java',
  },
  javascript: {
    desc: 'ওয়েবের স্ক্রিপ্টিং ভাষা।',
    link: '<1> <2>MDN-এ জাভাস্ক্রিপ্ট</2> </1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=জাভাস্ক্রিপ্ট</4> </3> <5> <6>লাইভকোডস ডকুমেন্টেশন</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'JavaScript',
  },
  jinja: {
    desc: 'Jinja একটি দ্রুত, প্রকাশক, এক্সটেনসিবল টেমপ্লেটিং ইঞ্জিন।',
    link: '<1> <2>অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>টেমপ্লেট ডকুমেন্টেশন</4> </3> <5> <6>JavaScript বাস্তবায়ন</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7>',
    name: 'Jinja',
  },
  jsx: {
    desc: 'JSX LiveCodes-এ TypeScript কম্পাইলার ব্যবহার করে JavaScript-এ কম্পাইল হয়। ডিফল্টভাবে এটি JSX রানটাইম হিসাবে React ব্যবহার করে।',
    link: '<1> <2>React অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>React ডকুমেন্টেশনে JSX</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5>',
    name: 'JSX',
  },
  julia: {
    desc1: 'LiveCodes-এ Julia ভাষা সমর্থন এখনও পরীক্ষামূলক',
    desc2:
      'WASM-এ চলমান Julia কম্পাইলার এবং Julia Base, <2>polylang.io</2> দ্বারা অভিযোজিত <1>julia-wasm</1> ব্যবহার করে',
    link: '<1> <2>Julia অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Julia ডকুমেন্টেশন</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=Julia</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'Julia',
  },
  less: {
    desc: 'এটি CSS, কিছুটা বেশি সহ।',
    link: '<1><2>Less অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=less</4> </3>',
    name: 'Less',
  },
  liquid: {
    desc: 'একটি সহজ, প্রকাশক এবং নিরাপদ টেমপ্লেট ইঞ্জিন।',
    link: '<1> <2>LiquidJS অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>LiquidJS ডকুমেন্টেশন</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5>',
    name: 'LiquidJS',
  },
  livescript: {
    desc: 'একটি ভাষা যা JavaScript-এ কম্পাইল হয়।',
    link: '<1> <2>LiveScript অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=LiveScript</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'LiveScript',
  },
  lua: {
    desc: 'fengari-web ব্যবহার করে ব্রাউজারে চলমান Lua।',
    link: '<1><2>Lua অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Lua ডকুমেন্টেশন</4> </3> <5> <6>Fengari অফিসিয়াল ওয়েবসাইট</6> </5> <7> <8>fengari-web GitHub রেপো</8> </7> <9> <10>Y মিনিটে X শিখুন, যেখানে X=Lua</10> </9> <11> <12>LiveCodes ডকুমেন্টেশন</12> </11> <13> <14>স্টার্টার টেমপ্লেট লোড করুন</14> </13>',
    name: 'Lua',
  },
  luaWasm: {
    desc: 'Wasmoon ব্যবহার করে ব্রাউজারে চলমান Lua, WebAssembly দিয়ে তৈরি JS বাইন্ডিং সহ একটি আসল lua 5.4 VM।',
    link: '<1><2>Lua অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Lua ডকুমেন্টেশন</4> </3> <5> <6>Wasmoon GitHub রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=Lua</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'Lua (Wasm)',
  },
  malina: {
    desc: 'ফ্রন্টএন্ড কম্পাইলার, Svelte দ্বারা অনুপ্রাণিত।',
    link: '<1> <2>Malina.js রেপো</2> </1> <3> <4>Malina.js ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Malina.js',
  },
  markdown: {
    desc: 'Marked ব্যবহার করে HTML-এ কম্পাইল করা Markdown।',
    link: '<1> <2>Markdown অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Marked ডকুমেন্টেশন</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=markdown</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'Markdown',
  },
  mdx: {
    desc: 'কম্পোনেন্ট যুগের জন্য Markdown। <1></1>MDX আপনাকে আপনার Markdown ডকুমেন্টে নির্বিঘ্নে JSX লিখতে দেয়।',
    link: '<1><2>MDX ডকুমেন্টেশন</2></1> <3> <4>স্টার্টার টেমপ্লেট লোড করুন</4> </3>',
    name: 'MDX',
  },
  minizinc: {
    desc: 'মিনিজিঙ্ক একটি উচ্চ-স্তরের সীমাবদ্ধ মডেলিং ভাষা যা আপনাকে সহজেই বিচ্ছিন্ন অপ্টিমাইজেশন সমস্যাগুলি প্রকাশ করতে এবং সমাধান করতে দেয়।',
    link: '<1> <2>মিনিজিঙ্কের অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>মিনিজিঙ্ক ডকুমেন্টেশন</4> </3> <5> <6>মিনিজিঙ্ক টিউটোরিয়াল</6> </5> <7> <8>লাইভকোডস ডকুমেন্টেশন</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'MiniZinc',
  },
  mjml: {
    desc: 'MJML একটি মার্কআপ ভাষা যা একটি রেসপন্সিভ ইমেইল কোডিং করার কষ্ট কমানোর জন্য ডিজাইন করা হয়েছে।',
    link: '<1><2>MJML অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>MJML ডকুমেন্টেশন</4> </3> <5> <6>MJML অফিসিয়াল টেমপ্লেট</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7>',
    name: 'MJML',
  },
  mustache: {
    desc: 'লজিকবিহীন টেমপ্লেট।',
    link: '<1> <2>অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>mustache(5) ম্যানুয়াল</4> </3> <5> <6>JavaScript বাস্তবায়ন</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7>',
    name: 'Mustache',
  },
  nunjucks: {
    desc: 'JavaScript-এর জন্য একটি সমৃদ্ধ এবং শক্তিশালী টেমপ্লেটিং ভাষা। Nunjucks মূলত <1>jinja2</1> এর একটি পোর্ট',
    link: '<1> <2>অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>LiveCodes ডকুমেন্টেশন</4> </3>',
    name: 'Nunjucks',
  },
  ocaml: {
    desc1:
      'OCaml একটি শিল্প-মানের প্রোগ্রামিং ভাষা যা ফাংশনাল, ইম্পেরেটিভ এবং অবজেক্ট-ওরিয়েন্টেড স্টাইল সমর্থন করে।',
    desc2: 'এখানে OCaml থেকে JavaScript-এ কম্পাইল করতে ReScript কম্পাইলার ব্যবহার করা হয়।',
    link: '<1><2>OCaml ওয়েবসাইট</2></1> <3> <4>OCaml ডকুমেন্টেশন</4> </3> <5> <6>ReScript ওয়েবসাইট</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=OCaml</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'OCaml',
  },
  perl: {
    desc: 'Perlito ব্যবহার করে ব্রাউজারে চলমান Perl।',
    link: '<1> <2>Perl অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Perl ডকুমেন্টেশন</4> </3> <5> <6>Perlito5 Readme</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=perl</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Perl',
  },
  php: {
    desc: 'Uniter ব্যবহার করে ব্রাউজারে চলমান PHP।',
    link: '<1><2>PHP অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>PHP ডকুমেন্টেশন</4> </3> <5> <6>Uniter GitHub রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=PHP</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'PHP',
  },
  phpWasm: {
    desc: 'ব্রাউজারে PHP, WebAssembly দ্বারা চালিত, php-wasm ব্যবহার করে।',
    link: '<1><2>PHP অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>PHP ডকুমেন্টেশন</4> </3> <5> <6>php-wasm GitHub রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=PHP</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'PHP (Wasm)',
  },
  postgresql: {
    desc: 'PGlite ব্যবহার করে WASM হিসাবে প্যাকেজ করা PostgreSQL',
    link: '<1> <2>PostgreSQL অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>PostgreSQL ডকুমেন্টেশন</4> </3> <5> <6>PGlite GitHub রেপো</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=SQL</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'PostgreSQL',
  },
  prolog: {
    desc: 'JavaScript-এ একটি ওপেন সোর্স Prolog ইন্টারপ্রেটার।',
    link: '<1> <2>Tau Prolog অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Tau Prolog ডকুমেন্টেশন</4> </3> <5> <6>SWI-Prolog</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=Prolog</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Tau Prolog',
  },
  pug: {
    desc: 'মজবুত, মার্জিত, বৈশিষ্ট্য সমৃদ্ধ টেমপ্লেট ইঞ্জিন।',
    link: '<1> <2>Pug ডকুমেন্টেশন</2> </1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=Pug</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5>',
    name: 'Pug',
  },
  python: {
    desc: 'Brython ব্যবহার করে ব্রাউজারে চলমান Python।',
    link: '<1> <2>Python অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Python ডকুমেন্টেশন</4> </3> <5> <6>Brython ডকুমেন্টেশন</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=Python</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'Python',
  },
  pythonWasm: {
    desc1: 'Pyodide ব্যবহার করে WebAssembly-তে কম্পাইল করা বৈজ্ঞানিক স্ট্যাক সহ Python।',
    desc2:
      'Pyodide NumPy, Pandas, Matplotlib, SciPy, scikit-learn এবং আরো অনেক কিছু সহ Python বৈজ্ঞানিক স্ট্যাক ব্যবহার করার অনুমতি দেয়। এছাড়াও PyPi থেকে বিশুদ্ধ Python হুইল ইনস্টল করা সম্ভব।',
    link: '<1> <2>Python অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Python ডকুমেন্টেশন</4> </3> <5><6>Pyodide ডকুমেন্টেশন</6></5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=Python</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'Python (Wasm)',
  },
  r: {
    desc: 'WebR ব্যবহার করে ব্রাউজারে চলমান R।',
    link: '<1> <2>R প্রজেক্ট অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>R ম্যানুয়াল</4> </3> <5> <6>R for Data Science (2e)</6> </5> <7> <8>WebR ডকুমেন্টেশন</8> </7> <9> <10>Y মিনিটে X শিখুন, যেখানে X=R</10> </9> <11> <12>LiveCodes ডকুমেন্টেশন</12> </11> <13> <14>স্টার্টার টেমপ্লেট লোড করুন</14> </13>',
    name: 'R',
  },
  react: {
    desc: 'React Compiler একটি বিল্ড-টাইম শুধুমাত্র টুল যা স্বয়ংক্রিয়ভাবে React অ্যাপ অপ্টিমাইজ করে।',
    link: '<1> <2>React অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>React Compiler</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'React Compiler',
  },
  reactNative: {
    desc: 'React Native for Web হলো React Native-এর কম্পোনেন্ট এবং API-এর একটি অ্যাক্সেসযোগ্য বাস্তবায়ন যা React DOM-এর সাথে ইন্টারঅপারেবল।',
    link: '<1> <2>React অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>React Native ওয়েবসাইট</4> </3> <5> <6>React Native for Web ওয়েবসাইট</6> </5> <7> <8>React Native ডকুমেন্টেশন</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'React Native for Web',
  },
  reactNativeTsx: {
    desc: 'React Native for Web হলো React Native-এর কম্পোনেন্ট এবং API-এর একটি অ্যাক্সেসযোগ্য বাস্তবায়ন যা React DOM-এর সাথে ইন্টারঅপারেবল।',
    link: '<1> <2>React অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>React Native ওয়েবসাইট</4> </3> <5> <6>React Native for Web ওয়েবসাইট</6> </5> <7> <8>React Native ডকুমেন্টেশন</8> </7> <9> <10>TypeScript ওয়েবসাইট</10> </9> <11> <12>TypeScript ডকুমেন্টেশন</12> </11> <13> <14>LiveCodes ডকুমেন্টেশন</14> </13> <15> <16>স্টার্টার টেমপ্লেট লোড করুন (JSX)</16> </15>',
    name: 'React Native for Web (TypeScript সহ)',
  },
  reactTsx: {
    desc: 'React Compiler একটি বিল্ড-টাইম শুধুমাত্র টুল যা স্বয়ংক্রিয়ভাবে React অ্যাপ অপ্টিমাইজ করে।',
    link: '<1> <2>React অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>React Compiler</4> </3> <5> <6>TypeScript ওয়েবসাইট</6> </5> <7> <8>TypeScript ডকুমেন্টেশন</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন (JSX)</12> </11>',
    name: 'React Compiler (TypeScript সহ)',
  },
  reason: {
    desc1:
      'Reason আপনাকে সহজ, দ্রুত এবং গুণমান টাইপ সেফ কোড লিখতে দেয় যখন JavaScript এবং OCaml উভয় ইকোসিস্টেম ব্যবহার করে।',
    desc2: 'এখানে Reason থেকে JavaScript-এ কম্পাইল করতে ReScript কম্পাইলার ব্যবহার করা হয়।',
    link: '<1><2>Reason ওয়েবসাইট</2></1> <3> <4>Reason ডকুমেন্টেশন</4> </3> <5> <6>ReasonReact</6> </5> <7> <8>ReScript ওয়েবসাইট</8> </7> <9> <10>Y মিনিটে X শিখুন, যেখানে X=reason</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
    name: 'Reason',
  },
  rescript: {
    desc: 'ReScript একটি মজবুতভাবে টাইপ করা ভাষা যা দক্ষ এবং মানব-পাঠযোগ্য JavaScript-এ কম্পাইল হয়।',
    link: '<1> <2>ReScript ওয়েবসাইট</2> </1> <3> <4>ReScript / React</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'ReScript',
  },
  richtext: {
    desc1: 'Quill ব্যবহার করে:',
    desc2: 'আপনার শক্তিশালী রিচ টেক্সট এডিটর।',
    link: '<1> <2>Quill অফিসিয়াল ওয়েবসাইট</2> </1>',
    name: 'রিচ টেক্সট এডিটর',
  },
  riot: {
    desc: 'সহজ এবং মার্জিত কম্পোনেন্ট-ভিত্তিক UI লাইব্রেরি।',
    link: '<1> <2>Riot.js অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Riot.js ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Riot.js',
  },
  ruby: {
    desc: 'Opal ব্যবহার করে ব্রাউজারে চলমান Ruby।',
    link: '<1> <2>Ruby অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Ruby ডকুমেন্টেশন</4> </3> <5><6>Opal অফিসিয়াল ওয়েবসাইট</6></5> <7> <8>Opal স্ট্যান্ডার্ড লাইব্রেরি CDN</8> </7> <9> <10>Y মিনিটে X শিখুন, যেখানে X=ruby</10> </9> <11> <12>LiveCodes ডকুমেন্টেশন</12> </11> <13> <14>স্টার্টার টেমপ্লেট লোড করুন</14> </13>',
    name: 'Ruby',
  },
  rubyWasm: {
    desc: 'ruby-wasm (CRuby-এর WebAssembly পোর্টগুলির একটি সংগ্রহ) ব্যবহার করে ব্রাউজারে চলমান Ruby।',
    link: '<1> <2>Ruby অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Ruby ডকুমেন্টেশন</4> </3> <5> <6>ruby.wasm ওয়েবসাইট</6> </5> <7><8>CRuby</8></7> <9> <10>Y মিনিটে X শিখুন, যেখানে X=ruby</10> </9> <11> <12>LiveCodes ডকুমেন্টেশন</12> </11> <13> <14>স্টার্টার টেমপ্লেট লোড করুন</14> </13>',
    name: 'Ruby (WASM)',
  },
  sass: {
    desc: 'সিনট্যাক্টিক্যালি অসাধারণ স্টাইল শীট।',
    link: '<1> <2>Sass অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Sass ডকুমেন্টেশন</4> </3> <5> <6>Sass (ইন্ডেন্টেড) সিনট্যাক্স</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=sass</8> </7>',
    name: 'Sass',
  },
  scheme: {
    desc: 'biwascheme ব্যবহার করে ব্রাউজারে চলমান Scheme।',
    link: '<1> <2>Scheme প্রোগ্রামিং ভাষা</2> </1> <3> <4>BiwaScheme অফিসিয়াল ওয়েবসাইট</4> </3> <5> <6>BiwaScheme রেফারেন্স</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'Scheme',
  },
  scss: {
    desc: 'সিনট্যাক্টিক্যালি অসাধারণ স্টাইল শীট।',
    link: '<1> <2>Sass অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Sass ডকুমেন্টেশন</4> </3> <5> <6>SCSS সিনট্যাক্স</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=sass</8> </7>',
    name: 'SCSS',
  },
  solid: {
    desc: 'ব্যবহারকারী ইন্টারফেস তৈরির জন্য একটি ঘোষণামূলক, দক্ষ এবং নমনীয় JavaScript লাইব্রেরি।',
    link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1> <3><4>ডকুমেন্টেশন</4></3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন (TSX)</8> </7>',
    name: 'Solid',
    tsx: {
      desc: 'ব্যবহারকারী ইন্টারফেস তৈরির জন্য একটি ঘোষণামূলক, দক্ষ এবং নমনীয় JavaScript লাইব্রেরি।',
      link: '<1><2>অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Solid ডকুমেন্টেশন</4> </3> <5> <6>TypeScript ওয়েবসাইট</6> </5> <7> <8>TypeScript ডকুমেন্টেশন</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9> <11> <12>স্টার্টার টেমপ্লেট লোড করুন</12> </11>',
      name: 'Solid (TypeScript সহ)',
    },
  },
  sql: {
    desc: 'SQL.js ব্যবহার করে JavaScript-এ কম্পাইল করা SQLite',
    link: '<1> <2>SQLite অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>SQLite সিনট্যাক্স ডকুমেন্টেশন</4> </3> <5> <6>SQL.js অফিসিয়াল ওয়েবসাইট</6> </5> <7> <8>Y মিনিটে X শিখুন, যেখানে X=SQL</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'SQLite',
  },
  stencil: {
    desc: 'ওয়েব কম্পোনেন্ট এবং উচ্চ কর্মক্ষমতা ওয়েব অ্যাপের জন্য একটি কম্পাইলার।',
    link: '<1> <2>Stencil অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Stencil ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Stencil',
  },
  styleProcessors: {
    link: '<1> <2>Tailwind CSS</2> </1> <3> <4>Windi CSS</4> </3> <5> <6>UnoCSS</6> </5> <7> <8>Lightning CSS</8> </7> <9> <10>PostCSS</10> প্লাগইন: <11> <12> <13>Autoprefixer</13> </12> <14> <15>postcss-preset-env</15> </14> <16> <17>postcss-import-url</17> </16> <18> <19>postcss-modules</19> </18> </11> </9>',
    name: 'CSS ফ্রেমওয়ার্ক এবং প্রসেসর',
  },
  stylis: {
    desc: 'হালকা ওজনের css প্রিপ্রসেসর।',
    link: '<1> <2>Stylis অফিসিয়াল ওয়েবসাইট</2> </1>',
    name: 'Stylis',
  },
  stylus: {
    desc: 'প্রকাশক, ডায়নামিক, মজবুত CSS।',
    link: '<1> <2>Stylus অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Y মিনিটে X শিখুন, যেখানে X=stylus</4> </3>',
    name: 'Stylus',
  },
  sucrase: {
    desc: 'আধুনিক JS রানটাইম লক্ষ্য করতে পারলে Babel-এর সুপার-দ্রুত বিকল্প।',
    link: '<1> <2>Sucrase অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Sucrase GitHub রেপো</4> </3> <5> <6>LiveCodes ডকুমেন্টেশন</6> </5>',
    name: 'Sucrase',
  },
  svelte: {
    desc: 'সাইবারনেটিক্যালি উন্নত ওয়েব অ্যাপ।',
    link: '<1> <2>Svelte অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Svelte ডকুমেন্টেশন</4> </3> <5> <6>স্টার্টার টেমপ্লেট লোড করুন</6> </5>',
    name: 'Svelte',
  },
  tcl: {
    desc: '<1>wacl</1> ব্যবহার করে ব্রাউজারে চলমান Tcl।',
    link: '<1> <2>Tcl অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>wacl রেপো</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=Tcl</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'Tcl (Tool Command Language)',
  },
  teal: {
    desc: 'Lua-এর একটি টাইপড উপভাষা।',
    link: '<1> <2>Teal GitHub রেপো</2> </1> <3> <4>Teal ডক্স</4> </3> <5> <6>Teal টিউটোরিয়াল</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Teal',
  },
  tsx: {
    desc: 'JSX-এ TypeScript। TSX LiveCodes-এ TypeScript কম্পাইলার ব্যবহার করে JavaScript-এ কম্পাইল হয়। ডিফল্টভাবে এটি JSX রানটাইম হিসাবে React ব্যবহার করে।',
    link: '<1> <2>React অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>React ডকুমেন্টেশনে JSX</4> </3> <5> <6>Typescript ডকুমেন্টেশন</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7>',
    name: 'TSX',
  },
  twig: {
    desc: '<2>Twig.js</2> দ্বারা <1>Twig</1> PHP টেমপ্লেটিং ভাষার একটি JavaScript বাস্তবায়ন',
    link: '<1> <2>Twig অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Twig ডকুমেন্টেশন</4> </3> <5> <6>Twig.js রেপো</6> </5> <7> <8>Twig.js ডকুমেন্টেশন</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9>',
    name: 'Twig',
  },
  typescript: {
    desc: 'JavaScript-এর একটি টাইপড সুপারসেট।',
    link: '<1> <2>অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>TypeScript ডকুমেন্টেশন</4> </3> <5> <6>Y মিনিটে X শিখুন, যেখানে X=TypeScript</6> </5> <7> <8>স্টার্টার টেমপ্লেট লোড করুন</8> </7>',
    name: 'TypeScript',
  },
  vue: {
    link: '<1> <2>Vue.js v3 অফিসিয়াল ওয়েবসাইট</2> </1> <3> <4>Vue3 ডকুমেন্টেশন</4> </3> <5> <6>Vue3 সিঙ্গেল ফাইল কম্পোনেন্ট</6> </5> <7> <8>LiveCodes ডকুমেন্টেশন</8> </7> <9> <10>স্টার্টার টেমপ্লেট লোড করুন</10> </9>',
    name: 'Vue3 সিঙ্গেল ফাইল কম্পোনেন্ট',
  },
  vue2: {
    desc: 'vue3-sfc-loader ব্যবহার করে লোড করা হয়েছে।',
    link: '<1><2>Vue.js অফিসিয়াল ওয়েবসাইট</2></1> <3> <4>Vue2 ডকুমেন্টেশন</4> </3> <5> <6>Vue2 সিঙ্গেল ফাইল কম্পোনেন্ট</6> </5> <7> <8>vue3-sfc-loader GitHub রেপো</8> </7> <9> <10>LiveCodes ডকুমেন্টেশন</10> </9>',
    name: 'Vue2 সিঙ্গেল ফাইল কম্পোনেন্ট',
  },
  wat: {
    desc1: 'WebAssembly (wasm) বাইনারি ফরম্যাটের নিম্ন-স্তরের টেক্সটুয়াল উপস্থাপনা।',
    desc2: 'এটি wabt.js ব্যবহার করে wasm-এ রূপান্তরিত হয়।',
    link: '<1><2>WebAssembly.org</2></1> <3> <4>WebAssembly টেক্সট স্পেক্স</4> </3> <5> <6>MDN-এ WebAssembly</6> </5> <7> <8>WebAssembly টেক্সট ফরম্যাট বোঝা</8> </7> <9> <10>wabt.js ডকুমেন্টেশন</10> </9> <11> <12>Y মিনিটে X শিখুন, যেখানে X=WebAssembly</12> </11> <13> <14>স্টার্টার টেমপ্লেট লোড করুন</14> </13>',
    name: 'WebAssembly টেক্সট ফরম্যাট',
  },
};

export default languageInfo;
